/*
Όνομα: fib1
Είσοδος: Ένας φυσικός αριθμός n ο οποίος δηλώνει τον όρο της ακολουθίας fibonacci 
που πρέπει να υπολογιστεί 
Έξοδος: ο n-οστός όρος της ακολουθίας Fibonacci
Περιγραφή: Δέχεται ως είσοδο έναν φυσικό αριθμό n και επιστρέφει τον n-οστό
όρο της ακολουθίας fibonacci
Στην ακολουθία fibonacci κάθε όρος προκύπτει από το άθροισμα των δύο προηγουμένων.
Δηλαδή, έχουμε: 0,1,1,2,3,5,8,13,21,34...
*/
#include <stdio.h>

main(){
int n;
int f=0, i=1; /*Οι δύο πρώτοι όροι*/
int k;
/* Ανάγνωση του όρου που θέλουμε να υπολογιστεί*/
printf("Give n:");
scanf("%d",&n);

for(k=0;k<n;k++){
    f=f+i;
    i=f-i;
    }
/*Εκτύπωση του n-οστού όρου*/
printf("O %dos oros Fibonacci einai %d\n",n,f);
system("pause");
}
